#include <stdio.h> //แสดงผลข้อมูล

int main() {
    int n, i; //ประกาศตัวแปรชื่อ n และ i
    float score, sum = 0, avg; //ประกาศตัวแปรชื่อ score, sum, และ avg ซึ่งเป็นประเภท float หรือตัวเลขทศนิยม 

    printf("Enter number of students: "); //แสดงข้อความว่า "Enter number of students:"
    scanf("%d", &n); // ใช้สำหรับรับข้อมูลที่ผู้ใช้พิมพ์เข้ามา

    printf("Enter %d student scores (one per line):\n", n); // แสดงข้อความว่า "Enter n student scores (one per line):" โดยที่ %d จะถูกแทนที่ด้วยค่าของตัวแปร n ซึ่งเป็นจำนวนนักเรียน
    for(i = 1; i <= n; i++) { //for loop จะถูกทำซ้ำตามเงื่อนไขที่กำหนด i = 1 คือการกำหนดให้ตัวนับ i เริ่มต้นที่ 1i <= n คือเงื่อนไขการทำซ้ำ ลูปจะทำงานตราบเท่าที่ค่า i น้อยกว่าหรือเท่ากับจำนวนนักเรียน ni++ คือการเพิ่มค่าตัวนับ i ขึ้นทีละ 1 ในทุกๆ รอบที่ทำงาน
        printf("Score %d: ", i); //แสดงข้อความว่า "Score 1:", "Score 2:" ไปเรื่อยๆ ตามรอบของลูป
        scanf("%f", &score);
        sum += score; //บรรทัดนี้คือการนำค่าคะแนนที่เพิ่งรับเข้ามา (score) ไปบวกเพิ่มกับค่าผลรวมเดิม (sum) ผลลัพธ์จะถูกเก็บกลับไปในตัวแปร sum เพื่อรวมคะแนนทั้งหมดเข้าด้วยกัน
    }

    avg = sum / n; //เมื่อลูป for ทำงานเสร็จสิ้น บรรทัดนี้จะนำค่าผลรวมของคะแนนทั้งหมด (sum) มาหารด้วยจำนวนนักเรียนทั้งหมด (n) เพื่อหาค่าเฉลี่ย

    printf("\nNumber of students = %d\n", n); //แสดงผลลัพธ์จำนวนนักเรียนทั้งหมด \n คือคำสั่งขึ้นบรรทัดใหม่
    printf("Average score = %.2f\n", avg);  //แสดงผลลัพธ์คะแนนเฉลี่ยที่คำนวณได้ %.2f คือการบอกให้แสดงผลตัวเลขทศนิยมแค่ 2 ตำแหน่งเท่านั้น

    return 0;
}